[
    {
        "id": 1299730373748948992,
        "text": "Despite New Safety Guidelines, Experts Say Movie Theaters Are High-Risk Even with new safety guidelines in place, health experts say going to the movies is very risky during the pandemic.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1298537500152139776,
        "text": "What to Do When You Clash with Your Kid’s Grandparents About COVID-19 Experts say it's common for family members to have differing opinions about how best to protect kids from the COVID-19 pandemic, but it's best to…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1296982185866604544,
        "text": "What You Need to Know If You Plan to Fly on an Airplane During COVID-19 CE complete. I changed a couple of instances of \"contract COVID-19.\" Thank you!\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1296589694780809217,
        "text": "New COVID-19 Saliva Tests Now Available: Are They the Breakthrough We Need? The new tests can produce results in a matter of hours, allowing people to get treatment sooner if they test positive or return to work if they test…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1296197044839821320,
        "text": "Psychologist Talks to Healthline About Mental Strain of COVID-19 Dr. Timothy Legg spoke at a Healthline town hall today on the COVID-19 pandemic. The town hall also featured Dr. Anthony Fauci, director of the…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1294173774816976896,
        "text": "A Physician on the Front Lines Talks About Treating Patients and Getting COVID-19 For months, Dr. Raj Dasgupta has been treating patients as a pulmonary critical care physician at Keck Medicine of the University of Southern…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1293388582024024069,
        "text": "How Schools Can Easily Become ‘Superspreaders’ of COVID-19 Experts say schools need to implement safety precautions such as mask wearing and staggered class schedules to reduce the risk of COVID-19 spread.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1292241021867307008,
        "text": "For Homemade Face Masks, 3 Layers Are Better Than 1 New research finds although the CDC recommends even a single-layer cloth mask as protection, two or three layers are best.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1291833359673556992,
        "text": "There’s More Evidence That Black Americans Face High Risks from COVID-19 Gaps in healthcare make it harder for many Black Americans to manage chronic health conditions that may contribute to poor outcomes from COVID-19.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1291425649215905795,
        "text": "Do You Need to Wear Goggles to Stay Safe from COVID-19? New research shows that we could take it a step further by making sure our eyes are covered with protective goggles or a face shield.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1290640502375710727,
        "text": "How Pooled Testing Can Help Us Fight Spread of COVID-19 Testing is necessary to reopen the economy and schools — however it’s almost impossible to do this using conventional testing methods.nnnnThe FDA has…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1290232780161310721,
        "text": "COVID-19 Damaged Heart of Elite Athlete: What Does That Mean for the Rest of Us? Boston Red Sox pitcher Eduardo Rodriguez has been benched for a least a week after being diagnosed with inflammation of the heart muscle, possibly…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1289432542983012353,
        "text": "How and When Children Should Return to Sports During COVID-19 Experts say small group practices and clean common areas should be among the guidelines before children return to the playing field.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1289024800082538497,
        "text": "Medical Experts Say We Need a Second Shutdown to Control COVID-19 Over 150 medical experts signed an open letter advising government officials to implement a second shut down. They say we need to shut down in order…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1289024798778064896,
        "text": "New Research Finds Kids Just as Likely as Adults to Spread COVID-19 As the debate to reopen schools continues, new research shows that children can spread COVID-19 as easily as adults.\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1287107206052294657,
        "text": "Can You Have a Second Wave of COVID-19 If the First Never Ended? Many Americans wonder what the coming months of the pandemic will look like in states where case rates are currently high, as well as states where the…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1287107201346265090,
        "text": "How Businesses Requiring Masks Protects Workers and You from COVID-19 A growing number of businesses are putting policies into place requiring the use of face masks. Here’s how that will help us reduce the spread of…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1284042020609236992,
        "text": "Fauci Warns About ‘Post-Viral’ Syndrome After COVID-19 Dr. Anthony Fauci, Director of the National Institute of Allergy and Infectious Diseases and member of the White House Coronavirus Task Force…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1283619176939126785,
        "text": "Smoking Puts 1 in 3 Young Adults at High Risk for Severe COVID-19 New research looked at the health data of people between the ages of 18 and 25 and found that 32 percent of young adults are susceptible to…\n\n(Feed generated with FetchRSS)"
    },
    {
        "id": 1293805040763895809,
        "text": "Taste bud cells might not be a target of SARS-CoV-2: An early symptom among some COVID-19 patients is the loss of the sense of smell and/or taste, which led to the suspicion SARS-CoV-2 could be targeting taste buds. But initial data from mice suggest that might not be the ca…"
    },
    {
        "id": 1293265020944621569,
        "text": "Taste bud cells might not be a target of SARS-CoV-2: An early symptom among some COVID-19 patients is the loss of the sense of smell and/or taste, which led to the suspicion SARS-CoV-2 could be targeting taste buds. But initial data from mice suggest that might not be the ca…"
    },
    {
        "id": 1292944851445485568,
        "text": "Research Shows Exposure to Common Cold Coronaviruses Can Teach the Immune System to Recognize SARS-CoV-2\n\nResearchers caution: It is too soon to say whether pre-existing immune cell memory affects COVID-19 clinical outcomes. Your immune system's \"memory\" T cells keep track (1/2)"
    },
    {
        "id": 1290755971287937024,
        "text": "Exposure to common cold coronaviruses can teach the immune system to recognize SARS-CoV-2 – Medical Xpress"
    },
    {
        "id": 1290557398130851842,
        "text": "The six strains of SARS-CoV-2"
    },
    {
        "id": 1284396836367851527,
        "text": "Vaccine additives can enhance immune flexibility -- Implications for flu and SARS-CoV-2"
    },
    {
        "id": 1283990272674856960,
        "text": "Obesity and metabolic syndrome are risk factors for severe influenza, COVID-19: Metabolic syndrome increases the…"
    },
    {
        "id": 1283672029032599555,
        "text": "Common FDA-approved drug may effectively neutralize virus that causes COVID-19"
    },
    {
        "id": 1300441098884657154,
        "text": "The Antiviral used to treat cat coronavirus also works against SARS-CoV-2 #health"
    },
    {
        "id": 1299209996010500096,
        "text": "Antiviral used to treat cat coronavirus also works against SARS-CoV-2"
    },
    {
        "id": 1296564162374569984,
        "text": "Researchers show children are silent spreaders of virus that causes COVID-19. The infected children were shown to have a significantly higher level of virus in their airways than hospitalized adults in ICUs for COVID-19 treatment."
    },
    {
        "id": 1296483288849293313,
        "text": "Researchers show children are silent spreaders of virus that causes COVID-19. The infected children were shown to have a significantly higher level of virus in their airways than hospitalized adults in ICUs for COVID-19 treatment.\n\n#COVID19 \n#COVID19Lessons"
    },
    {
        "id": 1296435073496109062,
        "text": "Researchers show children are silent spreaders of virus that causes COVID-19. The infected children were shown to have a significantly higher level of virus in their airways than hospitalized adults in ICUs for COVID-19 treatment."
    },
    {
        "id": 1293261490368262145,
        "text": "Malaria discovery could expedite antiviral treatment for COVID-19\nNew research into malaria suggests targeting enzymes from the human host, rather than from the pathogen itself, could offer effective treatment for a range of infectious diseases, including COVID-19."
    },
    {
        "id": 1289060525687676934,
        "text": "Re-engineering antibodies for COVID-19"
    },
    {
        "id": 1289107889961959424,
        "text": "Rapid test for the determination of antibodies against Sars-Cov-2"
    },
    {
        "id": 1285850400474759169,
        "text": "Coronavirus antibodies fall dramatically in first 3 months after mild cases of COVID-19 according to new UCLA study. Decreasing by roughly half every 73 days. If sustained at that rate, the antibodies would disappear within about a year"
    },
    {
        "id": 1284768945392754688,
        "text": "Type 1 interferon deficiency: Biomarker of patients at risk of severe COVID-19  The two GOP senators both made the same blunder. Joey Ryan #HankHill"
    },
    {
        "id": 1284759207779205120,
        "text": "Type 1 interferon deficiency: Biomarker of patients at risk of severe COVID-19"
    },
    {
        "id": 1282222505672024064,
        "text": "Why lopinavir and hydroxychloroquine do not work on COVID-19"
    },
    {
        "id": 1282060431385919488,
        "text": "Study explains why lopinavir and hydroxychloroquine do not work on Covid-19: Results clearly indicate that drug metabolism enzymes (cytochrome P450 3A) are inhibited by systemic inflammation"
    },
    {
        "id": 1297189289747513344,
        "text": "Blood clots and lung injuries found in patients who have died of COVID-19!  Fujaira Prince Ziyech"
    },
    {
        "id": 1297019670709575680,
        "text": "Blood clots and lung injuries found in patients who have died of COVID-19- According to the scientists, in people with severe Covid-19, one of most abundant cytokines released is called TNF #VWFC #tfclive"
    },
    {
        "id": 1286571130266894336,
        "text": "Lung ultrasound shows duration, severity of coronavirus disease (COVID-19)"
    },
    {
        "id": 1291736891918884866,
        "text": "$COCP  💯 NEW ANTIVIRALS \nTHAT KILL  SARS-COV-2\nHOW MANY BILLIONS IN MKT CAP IS THIS WORTH?\n@$20= $1B MKT CAP* @$40=$2B @$100=$5B \n\n #CORONAVIRUS #COVID19 #COMPOUND6E"
    },
    {
        "id": 1291019363726708736,
        "text": "1/\nNeurological complications of COVID-19 have been described. What findings are common on imaging? What are the associated frequencies?\n\nWhat is the most common neuroimaging finding in adult patients hospitalized with COVID-19?"
    },
    {
        "id": 1281847813878566912,
        "text": "COVID-19: How do we explain 'happy' hypoxemia? #coronavirus"
    },
    {
        "id": 1279402748438593538,
        "text": "“MMR vaccine could prevent worst symptoms of COVID-19.” Y’all ready for the onslaught of adult-onset autism claims?! #youhearditherefirst #vaccinate #vaccinateyourkids"
    },
    {
        "id": 1282721768134840320,
        "text": "COVID-19 testing sites in Rochester to converge on July 13, 2020"
    },
    {
        "id": 1295669455880704002,
        "text": "$CLX Clorox and Cleveland Clinic Release Guide to Help People Stay Safer at Home During COVID-19\nFrom our Stock News Alerts App"
    },
    {
        "id": 1298749761042997248,
        "text": "CDC advises store employees not to argue with anti maskers. \n#OnlyInAmerica"
    },
    {
        "id": 1297915229423071232,
        "text": "via @nprnews: FDA Authorizes Convalescent Plasma As Emergency Treatment For COVID-19"
    },
    {
        "id": 1297870319399690241,
        "text": "WSJ:\nFDA authorizes convalescent plasma for Covid-19 use\nNew coronavirus cases in U.S. at the lowest level since late June\nGOP to call for keeping the economy open at this week's convention"
    },
    {
        "id": 1297763048115953665,
        "text": "FDA Authorizes Convalescent Plasma for Covid-19 Use\nThe emergency-use authorization comes after preliminary studies supported the benefits of the antibody-rich plasma taken from recovered Covid-19 patients."
    },
    {
        "id": 1297648824756797441,
        "text": "***FDA authorizes clearance for CONVALESCENT PLASMA as COVID-19 treatment"
    },
    {
        "id": 1297648328763637760,
        "text": "FDA authorizes COVID-19 plasma treatment\n\nThe Food and Drug Administration (FDA) announced Sunday that it has authorized convalescent plasma for emergency use to treat patients sickened by the novel coronavirus."
    },
    {
        "id": 1289894134493270023,
        "text": "Which HCPs Are Most Likely to Get COVID Vaccine? – WebMD"
    },
    {
        "id": 1289392076426100736,
        "text": "Which HCPs Are Most Likely to Get COVID Vaccine?"
    },
    {
        "id": 1288872769678008320,
        "text": "Former GOP Candidate Herman Cain Dies of COVID-19"
    },
    {
        "id": 1286964422439833600,
        "text": "CDC releases updated guidelines in favor of reopening schools is 'critically important for our public health'."
    },
    {
        "id": 1286828526415511552,
        "text": "CDC guidelines favor reopening schools is 'critically important for our public health' in Russia as terrorists."
    },
    {
        "id": 1286747995606786049,
        "text": "House agree to $105 billion in coronavirus aid for schools is 'critically important for our public health' in push for reopening."
    },
    {
        "id": 1290249527979462656,
        "text": "BREAKING: \"There’s no silver bullet for COVID-19 at the moment &amp; there might never be\"\n\n~ @WHO \n\n#Covid_19 #COVID19"
    },
    {
        "id": 1290239666596114434,
        "text": "WHO just announced there's no silver bullet for COVID-19 and may never be\n\nSource: Spectator Index"
    },
    {
        "id": 1285760854722478080,
        "text": "Atlanta Mayor Keisha Lance Bottoms Tests Positive for COVID-19. TIME, 6 July 2020.\n\nMadam Mayor, \"this illness is not unto death, but for the glory of God...\""
    },
    {
        "id": 1280979352042106880,
        "text": "Interesting sequence of events:\n\nJul 6th, 2020\nGeorgia Governor Brian Kemp To Deploy 1,000 National Guard Troops To Atlanta After Democrat Mayor Keisha Bottoms Fails To Stop Violence\n\nThe same day\nAtlanta Mayor Keisha Lance Bottoms tests positive for Covid-19"
    },
    {
        "id": 1280894464505118723,
        "text": "Atlanta Mayor Keisha Bottoms Tests Positive For COVID-19 After Marching with Black Lives Matter Militants! @gatewaypundit \n\nBut, but, the Progressive Socialist Dems said the \"Protests/Riots\" didn't pose any risk of spreading COVID19!"
    },
    {
        "id": 1280757612217171968,
        "text": "Atlanta Mayor Keisha Lance Bottoms tests positive for COVID-19\nLance Bottoms confirmed that she, her husband, and one of her four children have tested positive for COVID-19."
    },
    {
        "id": 1280499491163049984,
        "text": "Atlanta mayor tests positive for COVID-19 – Atlanta Journal Constitution"
    },
    {
        "id": 1280386868098498560,
        "text": "Coronavirus updates 🇺🇸 : \nAtlanta Mayor Keisha Lance Bottoms tests positive for Covid-19"
    },
    {
        "id": 1280386194618998784,
        "text": "Atlanta Mayor Keisha Lance Bottoms tests positive for Covid-19: Bottoms, whom Joe Biden is considering as a running mate, says she has no symptoms. Via @globalbreaking_"
    },
    {
        "id": 1280380957787172865,
        "text": "Atlanta Mayor Keisha Lance Bottoms tests positive for Covid-19 – POLITICO"
    },
    {
        "id": 1280326563784011776,
        "text": "Coronavirus live news: Boris Johnson accuses care homes over deaths as US cases near 3m\n\nAtlanta mayor tests positive for Covid-19; Kenya emerges from lockdown; Israel reimposes restrictions. Follow the latest updates\n\nUS cases near 3m as White House claims country is a “lea…"
    },
    {
        "id": 1280287066446856193,
        "text": "Atlanta Mayor Keisha Lance Bottoms Tests Positive for COVID-19 \n\nGet Well Mayor Lance Bottoms we need your voice to speak against people who would kill an eight years old child &amp; she isn't the only child MURDERED last week &amp; it didn't involve a white👮 The SILENCE IS DEAFENING."
    },
    {
        "id": 1280262797088169984,
        "text": "JUST IN: \n\nAtlanta Mayor Keisha Lance Bottoms tests positive for COVID 19, is asymptotic."
    },
    {
        "id": 1280257774111293440,
        "text": "Mayor of Atlanta tests positive for #COVID-19"
    },
    {
        "id": 1280597155695091712,
        "text": "Studies Track Super-Spreading of COVID-19"
    },
    {
        "id": 1283810618189938693,
        "text": "Will COVID Pandemic's Environmental Benefit Last?"
    },
    {
        "id": 1284985315170480129,
        "text": "Could Bats Hold Clues to COVID Treatments? Don’t turn us to bat instead look into hydroxychloroqui. and Zinchttps://wb.md/2CENVNK from @WebMD"
    },
    {
        "id": 1284910956846419968,
        "text": "Have Lockdowns Worked to Control Coronavirus?"
    },
    {
        "id": 1278769337784872960,
        "text": "How Safe Is it to Use A Public Bathroom?"
    },
    {
        "id": 1280457678142279685,
        "text": "WHO discontinues hydroxychloroquine and lopinavir/ritonavir treatment arms for COVID-19: WHO"
    },
    {
        "id": 1279512344075341825,
        "text": "WHO discontinues hydroxychloroquine and lopinavir/ritonavir treatment arms for COVID-19😍💥🦾🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳"
    },
    {
        "id": 1279460543179431936,
        "text": "W.H.O. makes it official: \nWHO discontinues hydroxychloroquine and lopinavir/ritonavir treatment arms for COVID-19. \n   No improvement in mortality rates when compared to the standard of care."
    },
    {
        "id": 1286146782355812352,
        "text": "THANK YOU:  For reading/following our Blog and Channels and being in the know where wildfires are currently burning across our Nation. We also promote PSAs (Public Service Announcements), evacuations, shelters, closures, etc. \n\n1/2"
    },
    {
        "id": 1278274366313304064,
        "text": "Media needs to start telling folks basic symptoms of CV19 and Ad Council needs to sponsor some radio PSAs Pronto. Amazing lack of public service announcements on virus."
    },
    {
        "id": 1297044973968400384,
        "text": "Bui DP, McCaffrey K, Friedrichs M, et al. Racial and Ethnic Disparities Among COVID-19 Cases in Workplace Outbreaks by Industry Sector - Utah, March 6-June 5, 2020. MMWR Morb Mortal Wkly Rep. 2020;69(33):1133-1138. Published 2020 Aug 21. doi:10.15585/mmwr.mm6933e3"
    },
    {
        "id": 1291909515689033728,
        "text": "COVID-19–ASSOCIATED MULTISYSTEM INFLAMMATORY SYNDROME IN CHILDREN (10 DIED) — UNITED STATES, MARCH–JULY 2020"
    },
    {
        "id": 1288572820159713283,
        "text": "I just got an embargoed CDC report, \"Deaths and Years of Potential Life Lost from Excessive Alcohol Use – United States, 2011 – 2015.\" Light summer reading."
    },
    {
        "id": 1298228668204896258,
        "text": "What does HIV have to do with Covid-19?\n\nPCR played a central role in the HIV war (a war you don’t know about, that lasted 22 years, between Globalist post-modern HIV scientists and classical scientists.) The latter lost the war. Unless you count being correct as winning."
    },
    {
        "id": 1282020270010580992,
        "text": "I don’t know what trump thinking about Covid-19. He is under-estimate COVID-19 for sure . And ppl in US is paying for that price with Lives .   It’s not acceptable. Economy need to move. Ppl need to get a test before they have a synthem and regularly. Just like HIV or STD test"
    },
    {
        "id": 1281602725348872199,
        "text": "If you’re living with or affected by HIV, here’s what you need to know about COVID-19 and HIV.\n\nStay safe, friends. #COVIDconf"
    },
    {
        "id": 1288127153729486850,
        "text": "The Centers for Disease Control has extended its No Sail Order for cruise ships once again.\n\nThe order now prevents ships from sailing through September 30, 2020.\n\n#travel #coronavirus #socialdistancing #covid"
    },
    {
        "id": 1284223895407603715,
        "text": "US - CDC MEDIA STATEMENT: CRUISE SHIP NO SAIL ORDER EXTENDED THROUGH SEPTEMBER 2020 - JULY 16, 2020"
    },
    {
        "id": 1283883665638948873,
        "text": "So it’s not safe to have a bunch of people on a boat eating and playing together, but is ok for kids to eat and play in school?\n\n RT @EricLiptonNYT: CDC: Cruise ship No Sail Order extended through September 2020"
    },
    {
        "id": 1283882623744512002,
        "text": "CDC: Cruise ship No Sail Order extended through September 2020"
    },
    {
        "id": 1283876325518970881,
        "text": "The Centers for Disease Control and Prevention extended a No Sail Order for cruise ships through September 30, 2020. This order continues to suspend passenger operations on cruise ships with the capacity to carry at least 250 passengers in waters subject to U.S. jurisdiction."
    },
    {
        "id": 1284382413506908160,
        "text": "Symptom Profiles of a Convenience Sample of Patients with COVID-19 — United States, January–April 2020."
    },
    {
        "id": 1284382412579930113,
        "text": "Symptom Profiles of a Convenience Sample of Patients with COVID-19 — United States, January–April 2020."
    },
    {
        "id": 1283959634433396738,
        "text": "Symptom Profiles of a Convenience Sample of Patients with COVID-19 — United States, January–April 2020."
    },
    {
        "id": 1283959629203087363,
        "text": "Symptom Profiles of a Convenience Sample of Patients with COVID-19 — United States, January–April 2020."
    },
    {
        "id": 1281829444043382784,
        "text": "Waltenburg MA, Victoroff T, Rose CE, et al. Update: COVID-19 Among Workers in Meat and Poultry Processing Facilities - United States, April-May 2020. MMWR Morb Mortal Wkly Rep. 2020;69(27):887-892. Published 2020 Jul 10. doi:10.15585/mmwr.mm6927e2"
    },
    {
        "id": 1280865306475454465,
        "text": "“The CDC tried to develop clear guidelines about what the stages of re-opening should look like — the administration delayed and scaled them back.\""
    },
    {
        "id": 1282419733749542913,
        "text": "NotFakeNews: New Zealand let health experts” rather than politicians make decisions about how to deal with COVID-19, “and as of today they have zero COVID cases.”"
    },
    {
        "id": 1288996001664172037,
        "text": "In West Virginia alone, overdoses have increased by 50% during the #COVID__19 pandemic. We must stop the illegal drug flow across our Southern Border. \n\nThat’s why I added an amendment to 2021 government funding to #BuildTheWall. \n\nSadly, House Democrats voted this down."
    }
]