[
    {
        "id": 1300283193250246658,
        "text": "This week the CDC quietly updated the COVID-19 number to admit that only 6% of all the 153,504 deaths recorded actually died from (only) COVID-19. That's 9,210 deaths. The other 94% had 2-3 other serious illnesses &amp; the overwhelming majority were of advanced age."
    },
    {
        "id": 1300187087421886464,
        "text": "Is this true??\n\nThe #CDC quietly updated the #Covid number to admit that only 6% of all the 153,504 deaths recorded actually died from #COVID-19 .  \n\n153,504 x .06  = 9,210 deaths.  \n\nIs this #True?!?"
    },
    {
        "id": 1296588646552932352,
        "text": "Hydroxychloroquine is why Uganda, with a population of 43M, has only 15 COVID-19 deaths"
    },
    {
        "id": 1296234752463245313,
        "text": "Hydroxychloroquine is why Uganda, with a population of 43M, has only (15) COVID-19 deaths. Uganda, a country in east-central Africa, has a population of 42.729 million, which is 13% of the US’ population of 328.239 million in 2019 @GovMurphy has been EXAGGERATING the covid deaths"
    },
    {
        "id": 1290072458129584129,
        "text": "Out of curiosity \n\nWould you take a vaccine with 33% death rate to feel safe from a virus with 0.06% death rate?\n\nAsking for a friend"
    },
    {
        "id": 1296147201232719872,
        "text": "AND?  They are going to die?\n    Take the treatment WHITE COATS SUMMIT doctors have been using successfully in the US hydroxychloroquine cure for Covid-19.  These doctors have discussed the successful use of hydroxychloroquine, azithromycin, and zinc in their offices."
    },
    {
        "id": 1293055689078853632,
        "text": "I am a board certified internist with sub specialist training in hematology and oncology. I am a Yale University graduate. I am asking for you to sign a petition to promote early usage of hydroxychloroquine and zinc with azithromycin to cure COVID-19."
    },
    {
        "id": 1291139259529744384,
        "text": "July 31 at 8:40 AM\nYour post didn't follow our Community Standards\nBill Zimmer\nJuly 30 at 12:58 PM ·\nShared with Public\n\nThe cure for COVID-19: Hydroxychloroquine, Zinc,\nAzithromycin, and a Presidential election\n30 days in FB jail for this post!"
    },
    {
        "id": 1288959325981966337,
        "text": "Hydroxychloroquine, Zinc, and Azithromycin are the cure for Covid-19.\nMore cures include:\nVitamin C\nQuercitin, &amp; Zinc.\nAs well as ozonated saline chased with IVC &amp; Glutathione\nThank you Dr. Suzanne Humphries for this information."
    },
    {
        "id": 1288695178237272065,
        "text": "Masks may not help completely but they can slow the spread for COVID-19 and should be worn. According to many physicians, hydroxychloroquine is not the cure, however along with the antibiotic azithromycin and zinc with the correct dosage has helped many people recover."
    },
    {
        "id": 1288588802349363200,
        "text": "WOW: Physicians have gathered in Whashington DC to let the American people know there ARE effective treatment options for COVID-19. One physician from Texas says “we have a cure for COVID-19, it’s hydroxychloroquine, azithromycin and zinc.” #WhiteCoatSummit"
    },
    {
        "id": 1288438953666740224,
        "text": "Maybe hydroxychloroquine (a medication for malaria and arthritis), zinc and azithromycin can be a cure for COVID-19."
    },
    {
        "id": 1288346438317948930,
        "text": "WOW: Physicians have gathered in Washington DC to let the American people know there ARE effective treatment options available for COVID-19.\n\nOne physician from Texas says “we have a cure to COVID-19, it’s hydroxychloroquine, azithromycin and zinc.”\n\n#WhiteCoatSummit"
    },
    {
        "id": 1288331008811532288,
        "text": "I agree with Dr. Stella Immanuel. There is a cure for Covid 19, and it’s hydroxychloroquine, zinc &amp; azithromycin. Even Dr.Fauci knows this. He knew hydroxychloroquine was an effective treatment for that other coronavirus, SARS."
    },
    {
        "id": 1288306955220484100,
        "text": "Hydroxychloroquine 200 mg 2 X day for 5 days. 10 pills $10 copay Zinc sulfate 220 mg once a day for 5 days. 5 pills less than $10 Azithromycin 500 mg once a day for 5 days. 5 pills $10 copay \ncure/prophylactic for COVID-19 = $30\nFreedom = priceless It's about power and money!"
    },
    {
        "id": 1288230513459814406,
        "text": "Hydroxychloroquine, Azithromycin, and Zinc is the cure for Covid-19. Any Doctor withholding this treatment will be complicit and wait till the class action law suits happen. I hope losing your license is worth your hatred for Trump."
    },
    {
        "id": 1288138236272037889,
        "text": "TWITTER just deleted ALL videos from doctors claiming #hydroxychloroquine zinc and Azithromycin is the cure to COVID-19! WTF!😱"
    },
    {
        "id": 1288069362390315008,
        "text": "There is a cure for covid-19.the China virus it's called hydroxychloroquine, and zinc in combination with either azithromycin or doxycycline"
    },
    {
        "id": 1288052419285274627,
        "text": "#Hydroxychloroquine #zinc #Azithromycin are the cure to covid 19. We don’t need a vaccine. Thousands upon thousands  have been treated with this method and they are all okay. THE FDA IS LYING. FAUCI IS LYING. BILL GATES IS LYING."
    },
    {
        "id": 1287928617146765312,
        "text": "WOW: Physicians have gathered in Washington DC to let the American people know there ARE effective treatment options available for COVID-19.\n\nOne physician from Texas says “we have a cure to COVID-19, it’s hydroxychloroquine, azithromycin and zinc.”"
    },
    {
        "id": 1287912887705653248,
        "text": "One physician from Texas says “we have a cure to COVID-19, it’s hydroxychloroquine, azithromycin and zinc.”"
    },
    {
        "id": 1287909653326766082,
        "text": "Interesting! - Of 352 patients with COVID-19, all recovered and none died. They say we have the cure. Hydroxychloroquine before you get it, and Hydroxy and Zinc and Azithromycin to treat it if you get it. Of course, it has to be the correct dosages. 15 yr old study proves it."
    },
    {
        "id": 1287878555414585345,
        "text": "\"One physician from Texas says “we have a cure to COVID-19, it’s hydroxychloroquine, azithromycin and zinc.”\n#trumpwasright"
    }
]